app/views/users/show.html.erb

  <% @likes.each do|like|%>
      <% post=Post.find_by(id: like.post_id)%>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

        <div class="like-container">
            <% @likes_count=Like.where(post_id: post.id).count%>
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 2]]

              <% if current_user.id!=1%>
                <% if Like.find_by(user_id: current_user.id,post_id: post.id) %>
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 2], ["post_id", 49], ["LIMIT", 1]]

              <% else %>
                <% if Like.find_by(user_id: current_user.id,post_id: post.id) %>
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 2], ["LIMIT", 1]]