app/views/departments/show.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 57]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 57], ["LIMIT", 1]]
---
                <div class="like-container">
                    <% @likes_count=Like.where(post_id: post.id).count%>
                    <% if user_signed_in? %>
                        <% if Like.find_by(user_id: current_user.id,post_id: post.id) %>