app/views/posts/show.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 3], ["LIMIT", 1]]
---
                <% if user_signed_in? %>
                    <% if Like.find_by(user_id: current_user.id,post_id: @post.id) %>