app/controllers/application_controller.rb

    def like_operation
        if current_user.id!=1
            @post=Post.find_by(id: params[:id])
            @department=Department.find_by(id: @post.category)
            @like=Like.find_by(
                user_id: current_user.id,
                post_id: params[:id]
            )
            if @like==nil
                @like=Like.new(
                    user_id: current_user.id,
                    post_id: params[:id]
                )
                @like.save
                redirect_to("/departments/#{@department.id}")
            else
                @like.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 57], ["LIMIT", 1]]
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 2], ["post_id", 57], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["post_id", 57], ["created_at", "2020-02-26 15:53:42.926899"], ["updated_at", "2020-02-26 15:53:42.926899"]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 26]]

    def like_operation_show
        if current_user.id==1
            @post=Post.find_by(id: params[:id])
            @department=Department.find_by(id: @post.category)
            @like=Like.find_by(
                user_id: current_user.id,
                post_id: params[:id]
            )
            if @like==nil
                @like=Like.new(
                    user_id: current_user.id,
                    post_id: params[:id]
                )
                @like.save
                redirect_to("/posts/#{@post.id}")
            else
                @like.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 2], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["post_id", 2], ["created_at", "2020-02-27 23:51:44.677760"], ["updated_at", "2020-02-27 23:51:44.677760"]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 8]]

    def like_operation_user_show
        if current_user.id!=1
            @post=Post.find_by(id: params[:id])
            @department=Department.find_by(id: @post.category)
            @like=Like.find_by(
                user_id: current_user.id,
                post_id: params[:id]
            )
            if @like==nil
                @like=Like.new(
                    user_id: current_user.id,
                    post_id: params[:id]
                )
                @like.save
                redirect_to("/users/show")
            else
                @like.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 49], ["LIMIT", 1]]
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 2], ["post_id", 49], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["post_id", 2], ["created_at", "2020-02-28 11:16:15.227242"], ["updated_at", "2020-02-28 11:16:15.227242"]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 48]]