app/controllers/departments_controller.rb

  def show
    @department=Department.find_by(id: params[:id])
    @departments=Department.all
    @posts=Post.where(category: params[:id]).order(created_at: :desc)
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "departments".* FROM "departments"
SELECT "posts".* FROM "posts" WHERE "posts"."category" = ? ORDER BY "posts"."created_at" DESC  [["category", 1]]

  def create
    @department=Department.new(category: params[:category])
    if @department.save
---
INSERT INTO "departments" ("category", "created_at", "updated_at") VALUES (?, ?, ?)  [["category", "希望をくれる名言"], ["created_at", "2020-02-26 15:24:57.203861"], ["updated_at", "2020-02-26 15:24:57.203861"]]

  def edit
    @department=Department.find_by(id: params[:id])
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @department=Department.find_by(id: params[:id])
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]