app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 57], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 57]]
---
  def show
    @post=Post.find_by(id: params[:id])
    @likes_count=Like.where(post_id: @post.id).count

SELECT  "departments".* FROM "departments" ORDER BY "departments"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "posts" ("content", "content_eng", "author", "biography", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post=Post.new(
      content: params[:content],
      content_eng: params[:content_eng],
      author: params[:author],
      biography: params[:biography]
    )
    last=Department.last(1)[0][:id]
    for num in 1..last do
      if params[:status]==num.to_s
        @post.category=num
      end
    end
    if @post.category==nil
      @post.category=1
    end
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 49], ["LIMIT", 1]]
SELECT  "departments".* FROM "departments" ORDER BY "departments"."id" DESC LIMIT ?  [["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "人にどう思われてもいい。\r\nそう思えた時、道は大きく開かれる。"], ["updated_at", "2020-02-28 11:20:16.976664"], ["id", 49]]
---
  def update
    @post=Post.find_by(id: params[:id])
    @post.content=params[:content]
    @post.content_eng=params[:content_eng]
    @post.author=params[:author]
    @post.biography=params[:biography]
    last=Department.last(1)[0][:id]
    for num in 1..last do
      if params[:status]==num.to_s
        @post.category=num
      end
    end
    if @post.save