app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" ASC
---
  def index
    @users=User.all

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? ORDER BY "likes"."created_at" DESC  [["user_id", 2]]
---
  def show
    @user=current_user
    @likes=Like.where(user_id: @user.id)